app/views/medias/index.html.haml

.left-content
  - if @presenter.media_types.count <= 1
---
SELECT COUNT(*) FROM `medias` WHERE (`medias`.`media_type_id` = 4)


  - if @presenter.media_types.count > 1
---
SELECT `medias`.* FROM `medias` WHERE (`medias`.`media_type_id` = 4) ORDER BY name