app/controllers/corporates_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
      :offset => (page - 1) * page_size
    }

    user = User.find(self.user_id)