app/controllers/corporates_controller.rb

SELECT COUNT(DISTINCT `corporations`.`id`) FROM `corporations` LEFT OUTER JOIN corporation_supports ON corporations.id=corporation_supports.corporation_id AND user_id=4 WHERE (1=1)
---
    @presenter.corporations = records

    @default_map = {:id => '', :title => '', :website => '', :wikipedia => ''}
    if @presenter.corporations.count > 0