app/controllers/governments_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
	def executive
		user = User.find(self.user_id)

SELECT `states`.* FROM `states` WHERE (`states`.`abbreviation` = 'AL') LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
	def legislative
		if(params[:state].nil?) #State not defined, so display list of states
			@presenter = LegislativeStatePresenter.new
      @presenter.states = State.find(:all, :order => "name asc")
			render 'governments/legislative_states'
    else
      state = State.where(:abbreviation => params[:state]).first
      if state.nil?
        redirect_to :action => :legislative, :state => nil
        return
      end


			@presenter = LegislativePresenter.new
      user = User.find(self.user_id)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
	def agency
		user = User.find(self.user_id)