app/controllers/medias_controller.rb

	def index
    @presenter = MediaPresenter.new
    if(!params[:type].nil?) #type selected
      type = MediaType.where(:name => params[:type]).first
      if(type.nil?) #type could not be loaded
        redirect_to :type => nil, :network => nil
        return
      elsif type.level != 1 #type is not top level
        redirect_to :type => nil, :network => nil
        return
      end
      @presenter.media_types << type

      if(!params[:network].nil?) #network is specified
        network = Media.where(:name => params[:network]).first
        if(network.nil?) #network could not be found
          redirect_to :type => nil, :network => nil
          return
        elsif(! [3,4].include?(network.media_type_id.to_i)) #type must support second level
          redirect_to :type => nil, :network => nil
          return
        end

        @presenter.second_level << network

        #load shows for the network
        @presenter.third_level = Media.where(:parent_media_id => network.id)
---
SELECT `media_types`.* FROM `media_types` WHERE (`media_types`.`name` = 'Television') LIMIT 1
SELECT `medias`.* FROM `medias` WHERE (`medias`.`name` = 'ABC News') LIMIT 1
SELECT `medias`.* FROM `medias` WHERE (`medias`.`media_type_id` = 4) ORDER BY name
SELECT `medias`.* FROM `medias` WHERE (`medias`.`parent_media_id` = 1)



    else #top level
      @presenter.media_types = MediaType.where(:level => 1).order(:display_order)
---
SELECT `media_types`.* FROM `media_types` WHERE (`media_types`.`level` = 1) ORDER BY display_order