app/controllers/products_controller.rb

	def index
		#@presenter = ProductsIndexPresenter.new(nil)
		#@presenter.load(session[:user_id], params[:offset], 15, product_change_support_path)
		#@presenter

		page_size = 15
		page = [params[:page].to_i, 1].max

		#Set up search options
		search_options = {
			:select => %w{products.id name description logo social_score participation_rate },
			:filters => {},
			:sorting => {},
			:limit => page_size,
			:offset => (page - 1) * page_size
		}

		user = User.find(self.user_id)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1