app/controllers/services_controller.rb

	def check_unique_user
		username = params[:username]
		render :json => {'username' => username, 'unique'=> !User.exists?(:login => username)}
---
SELECT `users`.`id` FROM `users` WHERE (`users`.`username` = 'asdf') LIMIT 1